Revit 2026 API

# UIFabricationUtilsSetOpenConnectorIndicatorPlanColor Method

---

Sets the color of the open connector indicator in plan view.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static void SetOpenConnectorIndicatorPlanColor(
	Color color
)
```
```vb
Public Shared Sub SetOpenConnectorIndicatorPlanColor (
	color As Color
)
```
```cpp
public:
static void SetOpenConnectorIndicatorPlanColor(
	Color^ color
)
```
```fsharp
static member SetOpenConnectorIndicatorPlanColor :
        color : Color -> unit
```

#### Parameters

color Color

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

UIFabricationUtils Class

Autodesk.Revit.UI Namespace